Repository: ScaffoldArt/swift-form
Catalog: Sources/FormCraft/Resources/Localizable.xcstrings
Source language: en
Languages: es_mx

# cidrv4
source: Must be correct IPv4 cidr
es_mx: Debe ser un CIDR IPv4 válido

# cidrv6
source: Must be correct IPv6 cidr
es_mx: Debe ser un CIDR IPv6 válido

# cuid
source: Must be valid CUID
es_mx: Debe ser un CUID válido

# cuid2
source: Must be valid CUID2
es_mx: Debe ser un CUID2 válido

# e164phoneNumber
source: Must be a valid phone number
es_mx: Debe ser un número de teléfono válido

# email
source: Invalid email address
es_mx: Dirección de correo electrónico no válida

# endsWith
source: Value must end with %1$@
es_mx: El valor debe terminar con %1$@

# equals
source: Value of %1$@ does not match %2$@
es_mx: El valor de %1$@ no coincide con %2$@

# gt
source: Must be greater than %1$@
es_mx: Debe ser mayor que %1$@

# gte
source: Must be at least %1$@
es_mx: Debe ser al menos %1$@

# includes
source: Value must include %1$@
es_mx: El valor debe incluir %1$@

# invalidType
source: Invalid type: expected %1$@, received %2$@
es_mx: Tipo no válido: se esperaba %1$@, se recibió %2$@

# ipv4
source: Invalid IPv4 address
es_mx: Dirección IPv4 no válida

# ipv6
source: Invalid IPv6 address
es_mx: Dirección IPv6 no válida

# isoDate
source: Must be correct date YYYY-MM-DD
es_mx: Debe ser una fecha válida con el formato YYYY-MM-DD

# length
source: Must be exactly %1$@ characters long
es_mx: Debe tener exactamente %1$@ caracteres

# lowercase
source: Value must be lowercase
es_mx: El valor debe estar en minúsculas

# lt
source: Must be less than %1$@
es_mx: Debe ser menor que %1$@

# lte
source: Must not be more than %1$@
es_mx: No debe ser mayor que %1$@

# maxLength
source: Must be %1$@ or fewer characters long
es_mx: Debe tener como máximo %1$@ caracteres

# minLength
source: Must be %1$@ or more characters long
es_mx: Debe tener como mínimo %1$@ caracteres

# multipleOf
source: Must be a multiple of %1$@
es_mx: Debe ser un múltiplo de %1$@

# nanoId
source: Must be valid NanoID
es_mx: Debe ser un NanoID válido

# negative
source: Must be negative
es_mx: Debe ser negativo

# nonNegative
source: Must not be negative
es_mx: No debe ser negativo

# nonPositive
source: Must not be positive
es_mx: No debe ser positivo

# positive
source: Must be positive
es_mx: Debe ser positivo

# regex
source: Value is not valid
es_mx: El valor no es válido

# required
source: Field is required
es_mx: Campo requerido

# startsWith
source: Value must start with %1$@
es_mx: El valor debe comenzar con %1$@

# trimmed
source: Must not start or end with whitespace characters
es_mx: No debe comenzar ni terminar con espacios en blanco

# ulid
source: Must be valid ULID
es_mx: Debe ser un ULID válido

# unexpectedError
source: Unexpected error in union validation
es_mx: Error inesperado en la validación de unión

# uppercase
source: Value must be uppercase
es_mx: El valor debe estar en mayúsculas

# uuid
source: Must be valid UUID
es_mx: Debe ser un UUID válido
